Tekla.Structures.Datatype.Distance.UnitType
The distance units.

Tekla.Structures.Datatype.Distance.UnitType.Millimeter
The millimeter unit type.

Tekla.Structures.Datatype.Distance.UnitType.Centimeter
The centimeter unit type.

Tekla.Structures.Datatype.Distance.UnitType.Meter
The meter unit type.

Tekla.Structures.Datatype.Distance.UnitType.Inch
The inch unit type.

Tekla.Structures.Datatype.Distance.UnitType.Foot
The foot unit type.